CSI API ETABS v1

# cDStSP16_13330_2017SetPreference Method

---

Sets the value of a steel design preference item

**Namespace:** ETABSv1
**Assembly:** ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (1.27.0.0)

Syntax

C#

VB

C++

F#

Copy

    int SetPreference(
    	int Item,
    	double Value
    )

    Function SetPreference (
    	Item As Integer,
    	Value As Double
    ) As Integer

    Dim instance As cDStSP16_13330_2017
    Dim Item As Integer
    Dim Value As Double
    Dim returnValue As Integer

    returnValue = instance.SetPreference(Item,
    	Value)

    int SetPreference(
    	int Item,
    	double Value
    )

    abstract SetPreference :
            Item : int *
            Value : float -> int

#### Parameters

Item

    Type: SystemInt32
This is an integer between 1 and 16, inclusive, indicating the preference item
considered

  1. Multi-response case design
  2. Framing type (Not used anymore)
  3. Section class (Not used anymore)
  4. GammaM
  5. GammaC
  6. GammeU
  7. GammaC1
  8. Consider deflection
  9. DL deflection limit, L/Value
  10. SDL + LL deflection limit, L/Value
  11. LL deflection limit, L/Value (Not used anymore)
  12. Total load deflection limit, L/Value
  13. Total - Camber limit, L/Value
  14. Pattern live load factor
  15. Demand/capacity ratio limit
  16. Reliability factor
  17. Max Number of Auto Iterations

Value

    Type: SystemDouble
The value of the considered preference item

  1. Multi-response case design
     * 1 = Envelopes
     * 2 = Step-by-step
     * 3 = Last step
     * 4 = Envelopes -- All
     * 5 = Step-by-step -- All
  2. Framing type (Not used anymore)
  3. Section class (Not used anymore)
  4. GammaM

Value > 0

  5. GammaC

Value > 0

  6. GammaU

Value > 0

  7. GammaC1

Value > 0

  8. Consider deflection
     * 0 = No
     * Any other value = Yes
  9. DL deflection limit, L/Value

Value > 0

  10. SDL + LL deflection limit, L/Value

Value > 0

  11. LL deflection limit, L/Value (Not used anymore)
  12. Total deflection limit, L/Value

Value > 0

  13. Total camber limit, L/Value

Value > 0

  14. Pattern live load factor

Value >= 0

  15. Demand/capacity ratio limit

Value > 0

  16. Reliability factor

Value > 0

  17. Max Number of Auto Iterations

Value > 0

#### Return Value

Type: Int32
Returns zero if the item is successfully retrieved; otherwise, it returns a
nonzero value

Remarks

Examples

VB

Copy

    Public Sub Example()
       Dim SapModel As cSapModel
       Dim EtabsObject As cOAPI
       Dim ret As Integer = -1
       Dim Value As Double

    'create ETABS object
       Dim myHelper as cHelper = New Helper
       EtabsObject = myHelper.CreateObjectProgID("CSI.ETABS.API.ETABSObject")

    'start ETABS application
      ret = EtabsObject.ApplicationStart()

    'create SapModel object
       SapModel = EtabsObject.SapModel

    'initialize model
       ret = SapModel.InitializeNewModel()

    'create steel deck template model
       ret = SapModel.File.NewSteelDeck(4, 12, 12, 4, 4, 24, 24)

    'set steel design code
       ret = SapModel.DesignSteel.SetCode("SP 16.13330.2017")

    'get preference item
       ret = SapModel.DesignSteel.SP16_13330_2017.GetPreference(4, Value)

    'close ETABS
       EtabsObject.ApplicationExit(False)

    'clean up variables
       SapModel = Nothing
       EtabsObject = Nothing

    End Sub

See Also

#### Reference

cDStSP16_13330_2017 Interface

ETABSv1 Namespace

ETABS®, SAFE®, SAP2000® and CSiBridge® are registered trademarks of Computers
and Structures, Inc.

Copyright © Computers and Structures, Inc. 2023. All rights
reserved.

support@csiamerica.com